app/controllers/api/v1/auth_controller.rb

  def register
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "first_name", "last_name", "phone", "role", "bio", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def login
    user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "anna@example.com"], ["LIMIT", 1]]