app/controllers/api/v1/bookings_controller.rb

  def index
    if current_user.master?
      # Для мастеров показываем их записи
      @bookings = current_user.bookings.includes(:service).order(start_time: :desc)
    else
      # Для клиентов показываем записи где они клиенты
      @bookings = Booking.includes(:service, :user)
                        .where(client_email: current_user.email)
                        .order(start_time: :desc)
---
SELECT "bookings".* FROM "bookings" ORDER BY "bookings"."start_time" DESC
SELECT "services".* FROM "services" WHERE "services"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9)  [["id", 1], ["id", 9], ["id", 6], ["id", 3], ["id", 8], ["id", 5], ["id", 2], ["id", 7], ["id", 4]]
SELECT "services".* FROM "services" WHERE "services"."id" IN ($1, $2, $3, $4)  [["id", 95], ["id", 94], ["id", 93], ["id", 92]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 1], ["id", 3], ["id", 2]]

  def create
    @booking = Booking.new(booking_params)
    @booking.user = User.masters.find_by(id: params[:master_id])

    unless @booking.user
      return render json: { error: 'Мастер не найден' }, status: :not_found
    end

    if @booking.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
INSERT INTO "bookings" ("start_time", "end_time", "status", "user_id", "service_id", "client_name", "client_email", "client_phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update_status
    new_status = params[:status]

    unless %w[confirmed cancelled completed].include?(new_status)
      return render json: { error: 'Неверный статус' }, status: :bad_request
    end

    if @booking.update(status: new_status)
---
UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", "cancelled"], ["updated_at", "2025-08-05 18:18:50.840522"], ["id", 954]]