app/controllers/api/v1/bookings_controller.rb

  def create
    master = User.masters.find_by(id: params[:master_id])
    return render_error(code: 'not_found', message: 'Мастер не найден', status: :not_found) unless master

    service = master.services.find_by(id: booking_params[:service_id])
    unless service
      return render_error(code: 'validation_error', message: 'Услуга не найдена у выбранного мастера', status: :unprocessable_entity)
    end

    slot = master.time_slots.find_by(id: params[:time_slot_id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 91], ["LIMIT", 1]]