app/controllers/api/v1/services_controller.rb

  def create
    # Временно создаем услугу для первого мастера
    master = User.where(role: 'master').first
    @service = master.services.build(service_params)

    if @service.save
---
SELECT "users".* FROM "users" WHERE "users"."role" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["role", "master"], ["LIMIT", 1]]
INSERT INTO "services" ("name", "description", "price", "duration", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @service.update(service_params)
---
UPDATE "services" SET "price" = $1, "updated_at" = $2 WHERE "services"."id" = $3  [["price", "1499.0"], ["updated_at", "2025-08-05 17:54:35.968844"], ["id", 47]]

  def destroy
    @service.destroy
---
DELETE FROM "services" WHERE "services"."id" = $1  [["id", 50]]