app/models/booking.rb

  def no_time_conflicts
    return unless start_time && end_time && user_id

    # Конфликт по стандартному правилу пересечения интервалов:
    # (start_a < end_b) AND (end_a > start_b)
    conflicting_bookings = Booking.where(user_id: user_id)
                                  .where.not(id: id)
                                  .where(status: %w[pending confirmed])
                                  .where('start_time < ? AND end_time > ?', end_time, start_time)

    if conflicting_bookings.exists?
---
SELECT 1 AS one FROM "bookings" WHERE "bookings"."user_id" = $1 AND "bookings"."id" != $2 AND "bookings"."status" IN ($3, $4) AND ((start_time < '2025-08-20 13:41:58.404669' AND end_time > '2025-08-20 13:01:58.404669') OR (start_time < '2025-08-20 13:41:58.404669' AND end_time > '2025-08-20 13:41:58.404669') OR (start_time >= '2025-08-20 13:01:58.404669' AND end_time <= '2025-08-20 13:41:58.404669')) LIMIT $5  [["user_id", 42], ["id", 954], ["status", "pending"], ["status", "confirmed"], ["LIMIT", 1]]